> ary
=> ["a", "b", "c", "d", "e", "f", "g"]
> ary[1, 3] = %w[B C D]
=> ["B", "C", "D"
> ary
=> ["a", "B", "C", "D", "e", "f", "g"]
> ary[1..3] = %w[b c d]
=> ["b", "c", "d"]
> ary
=> ["a", "b", "c", "d", "e", "f", "g"]
